ELPasEDT/src/DataProcessors/ПереносВидовЗаписейИСобытийВДокументы/ПереносВидовЗаписейИСобытийВДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносВидовЗаписейИСобытийВДокументы</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КПереносу</name>
    <attributes>
      <name>ВидЗаписи</name>
      <type>
        <types>CatalogRef.ВидыЗаписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗакреплениеВидаЗаписиИСобытийЗаПодразделением</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданРанее</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗаписей</name>
    <attributes>
      <name>ВидЗаписи</name>
      <type>
        <types>CatalogRef.ВидыЗаписей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ELPasEDT/src/Documents/ОперативныйЖурнал/ОперативныйЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперативныйЖурнал</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <basedOn>Document.ОперативныйЖурнал</basedOn>
  <registerRecords>InformationRegister.СобытияОперативногоЖурнала</registerRecords>
  <registerRecords>InformationRegister.СостояниеОборудования</registerRecords>
  <registerRecords>InformationRegister.АктивныеСмены</registerRecords>
  <registerRecords>InformationRegister.ОборудованиеНаКонтроле</registerRecords>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияИРаспоряжения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>CatalogRef.ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаОперативногоЖурнала</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗакрытия</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтаршийСмены</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоОт</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаПрописью</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудованияДиспетчерское</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтданногоРаспоряжения</name>
    <type>
      <types>EnumRef.СтатусыОтданныхРаспоряжений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПерваяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чистовик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мШаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОборудования</name>
      <type>
        <types>EnumRef.СтатусыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАктуален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыходаИзСтроя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтныхРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольВыполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеЗаписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиспетчерскоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОборудования</name>
      <type>
        <types>EnumRef.СостоянияОборудованияОЖ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроляЗнаний</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИРежимы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыИРежимы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСмены</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УдалитьПоказателиЧекЛиста</types>
        <types>CatalogRef.ПоказателиЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыДляОзнакомления</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.Журналы</types>
      </type>
    </attributes>
    <attributes>
      <name>КОзнакомлениюПринимающему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/Documents/ЗакреплениеВидаЗаписиИСобытийЗаПодразделением/ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакреплениеВидаЗаписиИСобытийЗаПодразделением</name>
  <registerRecords>InformationRegister.ВидыЗаписейСобытияПоПодразделениям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеПоУмолчанию</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСобытий</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/Catalogs/ВидыЗаписей/ВидыЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаписей</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <predefined>
    <items>
      <name>Авария</name>
      <description>Авария</description>
    </items>
    <items>
      <name>Включение</name>
      <description>Включение</description>
    </items>
    <items>
      <name>ДополнениеВСоставСмены</name>
      <description>Дополнение в состав смены</description>
    </items>
    <items>
      <name>ИзменениеРежимаРаботыОборудования</name>
      <description>Изменение режима работы оборудования</description>
    </items>
    <items>
      <name>КонтрольВнешний</name>
      <description>Контроль внешний</description>
    </items>
    <items>
      <name>КонтрольЖурнала</name>
      <description>Контроль журнала</description>
    </items>
    <items>
      <name>КонтрольОборудования</name>
      <description>Контроль оборудования</description>
    </items>
    <items>
      <name>Неисправность</name>
      <description>Неисправность</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
    <items>
      <name>ОперативныеПереговоры</name>
      <description>Оперативные переговоры</description>
    </items>
    <items>
      <name>ОтклонениеПараметров</name>
      <description>Отклонение параметров</description>
    </items>
    <items>
      <name>Отключение</name>
      <description>Отключение</description>
    </items>
    <items>
      <name>ПередачаСмены</name>
      <description>Передача смены</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>РаспоряжениеНСС</name>
      <description>Распоряжение НСС</description>
    </items>
    <items>
      <name>РемонтОборудования</name>
      <description>Ремонт оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗаполнятьТЧСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТЧОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСобытиеПоУмолчанию</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьСобытия</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/DataProcessors/ПереносВидовЗаписейИСобытийВДокументы/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	//Виды Записей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыЗаписей.Ссылка КАК ВидЗаписи
		|ИЗ
		|	Справочник.ВидыЗаписей КАК ВидыЗаписей
		|ГДЕ
		|	НЕ ВидыЗаписей.ПометкаУдаления
		|	И НЕ ВидыЗаписей.Предопределенный
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Объект.ВидыЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//Таблица
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперативныйЖурнал.ВидЗаписи КАК ВидЗаписи,
		|	ОперативныйЖурнал.Событие КАК Событие,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОперативныйЖурнал.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.ОперативныйЖурнал КАК ОперативныйЖурнал
		|ГДЕ
		|	ОперативныйЖурнал.Проведен
		|	И НЕ ОперативныйЖурнал.ВидЗаписи.Предопределенный
		|	И НЕ ОперативныйЖурнал.Событие = ЗНАЧЕНИЕ(Справочник.События.ПустаяСсылка)
		|	И ОперативныйЖурнал.Подразделение.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперативныйЖурнал.ВидЗаписи,
		|	ОперативныйЖурнал.Событие
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Объект.КПереносу.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтроки(ВидЗаписи)  
	
	Для Каждого ТекСтр Из ВидЗаписи.УдалитьСобытия Цикл
		Если ЗначениеЗаполнено(ТекСтр.Событие) Тогда
			НовСтр = Объект.КПереносу.Добавить();
			НовСтр.ВидЗаписи = ВидЗаписи;
			НовСтр.Событие = ТекСтр.Событие;
			НовСтр.Порядок = ТекСтр.НомерСтроки;
			НовСтр.СобытиеПоУмолчанию = ВидЗаписи.УдалитьСобытиеПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(, "Заполнение Организации обязательно!");
		Возврат;
	КонецЕсли;
	
	Если Объект.КПереносу.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Таблица данных для переноса заполнена. Перезаполнить?", РежимДиалогаВопрос.ДаНет); 		
	КонецЕсли;
	Если Объект.КПереносу.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНаСервере(); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопрос(Ответ, ДопПарамтеры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.КПереносу.Очистить();
		ЗаполнитьТаблицуНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	Для Каждого ТекСтр Из Объект.ВидыЗаписей Цикл
		СтрокиОтбора = Объект.КПереносу.НайтиСтроки(Новый Структура("ВидЗаписи", ТекСтр.ВидЗаписи));
		Если СтрокиОтбора.Количество() > 0 Тогда
			НовДок = НайтиДокумент(ТекСтр.ВидЗаписи);
			Если НовДок = Неопределено Тогда
				НовДок = СоздатьНовыйДокумент(ТекСтр.ВидЗаписи, СтрокиОтбора);
				СозданРанее = Ложь;
			Иначе
				СозданРанее = Истина;
			КонецЕсли;
			НовСтр = Объект.Документы.Добавить();
			НовСтр.Документ = НовДок;
			НовСтр.СозданРанее = СозданРанее;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйДокумент(ВидЗаписи, мСтроки)
	
	НовДок = Документы.ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.СоздатьДокумент();
	НовДок.Дата = ТекущаяДата();
	НовДок.Организация = Объект.Организация;
	НовДок.Подразделение = Объект.Подразделение;
	НовДок.ВидЗаписи = ВидЗаписи;
	НовДок.СобытиеПоУмолчанию = мСтроки[0].Событие;
	НовДок.Комментарий = "Сформирован автоматически " + Формат(ТекущаяДата(), "ДЛФ=DD");
	
	Для Каждого ТекСтр Из мСтроки Цикл 
		НовСтр = НовДок.СписокСобытий.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
		НовСтр.Порядок = ТекСтр.НомерСтроки;
	КонецЦикла;
	
	Попытка
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		Возврат НовДок.Ссылка;
	Исключение
		Сообщить("Не удалось сформировать документ для вида записи " + ВидЗаписи);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция НайтиДокумент(ВидЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗакреплениеВидаЗаписиИСобытийЗаПодразделением КАК ЗакреплениеВидаЗаписиИСобытийЗаПодразделением
		|ГДЕ
		|	НЕ ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.ПометкаУдаления
		|	И ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.Подразделение = &Подразделение
		|	И ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.ВидЗаписи = &ВидЗаписи";
	
	Запрос.УстановитьПараметр("ВидЗаписи", ВидЗаписи);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПоказатьПредупреждение(, "Заполнение Подразделения обязательно!");
		Возврат;
	КонецЕсли;
	
	Объект.Документы.Очистить();
	СформироватьДокументыНаСервере();
	
	Элементы.Панель.ТекущаяСтраница = Элементы.СформированныеДокументы;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОДокументах(Ответ, ДопПарамтеры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Документы.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.КПереносу.Очистить();
	Объект.Документы.Очистить();
	Объект.Подразделение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.Документы.Очистить();
	
КонецПроцедуры
